[Killed] StringLiteral
main/components/DriverAvailability/DriverAvailabilityForm.js:6:80
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-function DriverAvailabilityForm({ initialContents, submitAction, buttonLabel = "Enter Info"}) {
+function DriverAvailabilityForm({ initialContents, submitAction, buttonLabel = ""}) {
     const navigate = useNavigate();
 
killedBy: DriverAvailabilityForm tests renders correctly with no initialContents
statusReason: Error: Unable to find an element with the text: /Enter Info/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
