[Killed] LogicalOperator
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:66:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Driver Availability</h1>
-                {driverAvailability &&
-                <DriverAvailabilityForm initialContents={driverAvailability} submitAction={onSubmit} buttonLabel="Update" />
+                {driverAvailability || <DriverAvailabilityForm initialContents={driverAvailability} submitAction={onSubmit} buttonLabel="Update" />
                 }
             </div>
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, driverId, day, startTime, endTime, notes}). If you meant to render a collection of children, use an array instead.
