[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:91:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Driver Availability" id="appnavbar-driverAvailability-dropdown" data-testid="appnavbar-driverAvailability-dropdown" >
-                  <NavDropdown.Item as={Link} to="/driverAvailability">Dashboard</NavDropdown.Item>
-                </NavDropdown>
-                )
+                hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Driver Availability" id="appnavbar-driverAvailability-dropdown" data-testid="appnavbar-driverAvailability-dropdown">
+                  <NavDropdown.Item as={Link} to="/driverAvailability">Dashboard</NavDropdown.Item>
+                </NavDropdown>
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:91:17
                 )
               }
               {
-                hasRole(currentUser, "ROLE_ADMIN") && (
-                  <NavDropdown title="Driver Availability" id="appnavbar-driverAvailability-dropdown" data-testid="appnavbar-driverAvailability-dropdown" >
-                  <NavDropdown.Item as={Link} to="/driverAvailability">Dashboard</NavDropdown.Item>
-                </NavDropdown>
-                )
+                false
               }
               {

[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:98:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-driverAvailability" as={Link} to="/driverAvailability/">Availability</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                isParticipant(currentUser) || <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown">
+                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
+                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-driverAvailability" as={Link} to="/driverAvailability/">Availability</NavDropdown.Item>
+                  </NavDropdown>
               }
               {

[Timeout] ConditionalExpression
main/components/Nav/AppNavbar.js:98:17
                 )
               }
               {
-                isParticipant(currentUser) && (
-                  <NavDropdown title="Shifts" id="appnavbar-shift-dropdown" data-testid="appnavbar-shift-dropdown" >
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-shifts" as={Link} to="/shift/">Shifts</NavDropdown.Item>
-                    <NavDropdown.Item data-testid="appnavbar-shift-dropdown-driverAvailability" as={Link} to="/driverAvailability/">Availability</NavDropdown.Item>
-                  </NavDropdown>
-                )
+                false
               }
               {
