[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityIndexPage.js:10:55
 import Button from 'react-bootstrap/Button';
 import { Link } from 'react-router-dom';
 
-export default function DriverAvailabilityIndexPage() {
-
-  const currentUser = useCurrentUser();
-
-  const { data: driverAvailability, error: _error, status: _status } =
-  useBackend(
-    // Stryker disable all : hard to test for query caching
-    ["/api/driverAvailability/admin/all"],
-    { method: "GET", url: "/api/driverAvailability/admin/all" },
-    []
-    // Stryker restore all 
-  );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <Button style={{ float: "right" }} as={Link} to="/driverAvailability/create">
-          Create Driver Availability
-        </Button>
-        <h1>Driver Availability</h1>
-        <DriverAvailabilityTable driverAvailability={driverAvailability} currentUser={currentUser} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function DriverAvailabilityIndexPage() {}
killedBy: DriverAvailabilityIndexPage tests renders without crashing for regular user
statusReason: Error: DriverAvailabilityIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
