[Killed] BooleanLiteral
main/pages/AdminRiderApplication/AdminRiderApplicationReviewPage.js:11:68
 import { toast } from "react-toastify";
 
 
-export default function AdminRiderApplicationReviewPage({storybook=false}) {
+export default function AdminRiderApplicationReviewPage({storybook=true}) {
   let { id } = useParams();
   const { data: currentUser } = useCurrentUser();
killedBy: AdminRiderApplicationReviewPage tests test approve, deny, expire Changes when you click Approve
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/admin/applications/riders"}

Number of calls: 0

[Killed] OptionalChaining
main/pages/AdminRiderApplication/AdminRiderApplicationReviewPage.js:15:17
   let { id } = useParams();
   const { data: currentUser } = useCurrentUser();
 
-  const email = currentUser.root?.user.email;
+  const email = currentUser.root.user.email;
 
   const { data: riderApplication, _error, _status } =
killedBy: AdminRiderApplicationReviewPage tests when the backend doesn't return a todo renders header but table is not present
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] ObjectLiteral
main/pages/AdminRiderApplication/AdminRiderApplicationReviewPage.js:24:17
       {  // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
         method: "GET",
         url: `/api/riderApplication`,
-        params: {
-          id
-        }
+        params: {}
       }
     );
killedBy: AdminRiderApplicationReviewPage tests test approve, deny, expire Changes when you click Approve
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationReviewForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/AdminRiderApplication/AdminRiderApplicationReviewPage.js:30:36
       }
     );
 
-    const objectToAxiosPutParams = (riderApplication) => ({
-      url: "/api/rider/admin",
-      method: "PUT",
-      params: {
-        id: riderApplication.id,
-        status: riderApplication.status,
-        notes: riderApplication.notes
-      },
-      data: { 
-        status: riderApplication.status,
-        notes: riderApplication.notes
-      }
-    });
+    const objectToAxiosPutParams = () => undefined;
   
     const onSuccess = (riderApplication) => {
killedBy: AdminRiderApplicationReviewPage tests test approve, deny, expire Changes when you click Approve
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/AdminRiderApplication/AdminRiderApplicationReviewPage.js:38:13
         status: riderApplication.status,
         notes: riderApplication.notes
       },
-      data: { 
-        status: riderApplication.status,
-        notes: riderApplication.notes
-      }
+      data: {}
     });
   
killedBy: AdminRiderApplicationReviewPage tests test approve, deny, expire Changes when you click Approve
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"status\":\"accepted\",\"notes\":\"you will not be approved\"}"
Received: "{}"

[Killed] StringLiteral
main/pages/AdminRiderApplication/AdminRiderApplicationReviewPage.js:45:13
     });
   
     const onSuccess = (riderApplication) => {
-      toast(`Application Updated - id: ${riderApplication.id}`);
+      toast(``);
     }
   
killedBy: AdminRiderApplicationReviewPage tests test approve, deny, expire Changes when you click Approve
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Application Updated - id: 17"
Received: ""

Number of calls: 1

[Killed] LogicalOperator
main/pages/AdminRiderApplication/AdminRiderApplicationReviewPage.js:69:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Review Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationReviewForm initialContents={riderApplication} submitAction={onSubmit} email={email}/>
+                {riderApplication || <RiderApplicationReviewForm initialContents={riderApplication} submitAction={onSubmit} email={email} />
                 }
             </div>
killedBy: AdminRiderApplicationReviewPage tests test approve, deny, expire Changes when you click Approve
statusReason: Error: Objects are not valid as a React child (found: object with keys {id, perm_number, status, email, created_date, updated_date, cancelled_date, description, notes}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/pages/AdminRiderApplication/AdminRiderApplicationReviewPage.js:69:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Review Rider Application</h1>
-                {riderApplication &&
-                <RiderApplicationReviewForm initialContents={riderApplication} submitAction={onSubmit} email={email}/>
+                {true
                 }
             </div>
killedBy: AdminRiderApplicationReviewPage tests test approve, deny, expire Changes when you click Approve
statusReason: Error: Unable to find an element by: [data-testid="RiderApplicationReviewForm-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
