[Killed] ArrowFunction
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:27:34
     );
 
 
-  const objectToAxiosPutParams = (driverAvailability) => ({
-    url: "/api/driverAvailability",
-    method: "PUT",
-    params: {
-      id: driverAvailability.id,
-    },
-    data: {
-        driverId: driverAvailability.driverId,
-        day: driverAvailability.day,
-        startTime: driverAvailability.startTime,
-        endTime: driverAvailability.endTime,
-        notes: driverAvailability.notes
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (driverAvailability) => {
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:42:45
     }
   });
 
-  const onSuccess = (driverAvailability) => {
-    toast(`Driver Availability Updated - id: ${driverAvailability.id}`);
-  }
+  const onSuccess = (driverAvailability) => {}
 
   const mutation = useBackendMutation(
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:43:11
   });
 
   const onSuccess = (driverAvailability) => {
-    toast(`Driver Availability Updated - id: ${driverAvailability.id}`);
+    toast(``);
   }
 
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Driver Availability Updated - id: 17"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:67:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Driver Availability</h1>
-                {driverAvailability &&
-                <DriverAvailabilityForm initialContents={driverAvailability} submitAction={onSubmit} buttonLabel="Update" />
+                {true
                 }
             </div>
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-driverId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/DriverAvailability/DriverAvailabilityEditPage.js:67:18
         <BasicLayout>
             <div className="pt-2">
                 <h1>Edit Driver Availability</h1>
-                {driverAvailability &&
-                <DriverAvailabilityForm initialContents={driverAvailability} submitAction={onSubmit} buttonLabel="Update" />
+                {false
                 }
             </div>
killedBy: DriverAvailabilityEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="DriverAvailabilityForm-driverId"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
