[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityCreatePage.js:3:56
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function DriverAvailabilityCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function DriverAvailabilityCreatePage() {}
killedBy: PlaceholderCreatePage tests Renders expected content
statusReason: Error: DriverAvailabilityCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
