[Killed] BlockStatement
main/pages/DriverAvailability/DriverAvailabilityIndexPage.js:3:55
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function DriverAvailabilityIndexPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p><a href="/driverAvailability/create">Create</a></p>
-        <p><a href="/driverAvailability/edit/1">Edit</a></p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function DriverAvailabilityIndexPage() {}
killedBy: DriverAvailabilityIndexPage tests Renders expected content
statusReason: Error: DriverAvailabilityIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
