[Killed] ArrowFunction
src/main/pages/ProfilePage.js:34:33
 
     const handleShow = () => setShow(true);
 
-    const objectToAxiosParams = () => ({
-        url: "/api/userprofile/update-cellPhone",
-        method: "PUT",
-        params: {
-         cellPhone: phoneNumber
-        }
-      })
+    const objectToAxiosParams = () => undefined
 
       const onSuccess = () => {
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] StringLiteral
src/main/pages/ProfilePage.js:35:14
     const handleShow = () => setShow(true);
 
     const objectToAxiosParams = () => ({
-        url: "/api/userprofile/update-cellPhone",
+        url: "",
         method: "PUT",
         params: {
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] StringLiteral
src/main/pages/ProfilePage.js:36:17
 
     const objectToAxiosParams = () => ({
         url: "/api/userprofile/update-cellPhone",
-        method: "PUT",
+        method: "",
         params: {
          cellPhone: phoneNumber
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BlockStatement
src/main/pages/ProfilePage.js:42:31
         }
       })
 
-      const onSuccess = () => {
-        toast(`Cell Phone number changed ${phoneNumber}`);
-        setUpdatedPhoneNumber(phoneNumber);
-        setWhichNumber(true);
-        handleClose();
-    };
+      const onSuccess = () => {};
     
     const mutation = useBackendMutation(
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"

[Killed] BooleanLiteral
src/main/pages/ProfilePage.js:45:24
       const onSuccess = () => {
         toast(`Cell Phone number changed ${phoneNumber}`);
         setUpdatedPhoneNumber(phoneNumber);
-        setWhichNumber(true);
+        setWhichNumber(false);
         handleClose();
     };
killedBy: CellPhone tests on submit, makes request to backend
statusReason: TestingLibraryElementError: Unable to find an element with the text: cell phone number: 987-654-3210. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
    <div

[Killed] BlockStatement
src/main/pages/ProfilePage.js:57:39
     );
     
 
-    const onSubmit = async (event) => {
-        event.preventDefault(); 
-        mutation.mutate(phoneNumber);
-    };
+    const onSubmit = async (event) => {};
 
 
killedBy: CellPhone tests on submit, makes request to backend
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="modal-title h4">Input phone number</div> instead

<html>
  <head />
  <body
    class="modal-open"
