[Killed] BlockStatement
main/components/Profile/RoleBadge.js:4:56
 import React from 'react';
 import { Badge } from "react-bootstrap";
 
-export default function RoleBadge({role, currentUser}) {
-   
-  const roles = currentUser.root.roles.map( (o) => o.authority );
-
-  const lcrole = role.replace("ROLE_","").toLowerCase();
-  return (
-     roles.includes(role) ?
-        <Badge style = {{margin: '0 5px'}} className="bg-primary" data-testid={`role-badge-${lcrole}`}>{lcrole}</Badge> 
-        :
-        <span data-testid={`role-missing-${lcrole}`}></span>
-  );
-}
+export default function RoleBadge({role, currentUser}) {}
killedBy: CellPhone tests renders correctly for regular logged in user
statusReason: Error: RoleBadge(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Survived] StringLiteral
main/components/Profile/RoleBadge.js:11:34
   const lcrole = role.replace("ROLE_","").toLowerCase();
   return (
      roles.includes(role) ?
-        <Badge style = {{margin: '0 5px'}} className="bg-primary" data-testid={`role-badge-${lcrole}`}>{lcrole}</Badge> 
+        <Badge style = {{margin: ""}} className="bg-primary" data-testid={`role-badge-${lcrole}`}>{lcrole}</Badge> 
         :
         <span data-testid={`role-missing-${lcrole}`}></span>
