[Survived] StringLiteral
src/main/pages/ProfilePage.js:92:45
         
                     <div style={{ display: 'flex', justifyContent: 'center' }}>
                       {/* Each RoleBadge wrapped in a div with left and right margins */}
-                      <div style={{ margin: '0 5px' }}>
+                      <div style={{ margin: "" }}>
                           <RoleBadge role={"ROLE_USER"} currentUser={currentUser} />
                       </div>

[Killed] StringLiteral
src/main/pages/ProfilePage.js:93:44
                     <div style={{ display: 'flex', justifyContent: 'center' }}>
                       {/* Each RoleBadge wrapped in a div with left and right margins */}
                       <div style={{ margin: '0 5px' }}>
-                          <RoleBadge role={"ROLE_USER"} currentUser={currentUser} />
+                          <RoleBadge role={""} currentUser={currentUser} />
                       </div>
                       <div style={{ margin: '0 5px' }}>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-user"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] ObjectLiteral
src/main/pages/ProfilePage.js:95:35
                       <div style={{ margin: '0 5px' }}>
                           <RoleBadge role={"ROLE_USER"} currentUser={currentUser} />
                       </div>
-                      <div style={{ margin: '0 5px' }}>
+                      <div style={{}}>
                           <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser} />
                       </div>

[Killed] StringLiteral
src/main/pages/ProfilePage.js:96:44
                           <RoleBadge role={"ROLE_USER"} currentUser={currentUser} />
                       </div>
                       <div style={{ margin: '0 5px' }}>
-                          <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser} />
+                          <RoleBadge role={""} currentUser={currentUser} />
                       </div>
                       <div style={{ margin: '0 5px' }}>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-member"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] StringLiteral
src/main/pages/ProfilePage.js:98:45
                       <div style={{ margin: '0 5px' }}>
                           <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser} />
                       </div>
-                      <div style={{ margin: '0 5px' }}>
+                      <div style={{ margin: "" }}>
                           <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser} />
                       </div>

[Killed] StringLiteral
src/main/pages/ProfilePage.js:99:44
                           <RoleBadge role={"ROLE_MEMBER"} currentUser={currentUser} />
                       </div>
                       <div style={{ margin: '0 5px' }}>
-                          <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser} />
+                          <RoleBadge role={""} currentUser={currentUser} />
                       </div>
                       <div style={{ margin: '0 5px' }}>
killedBy: ProfilePage tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="role-badge-admin"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/ProfilePage.js:102:44
                           <RoleBadge role={"ROLE_ADMIN"} currentUser={currentUser} />
                       </div>
                       <div style={{ margin: '0 5px' }}>
-                          <RoleBadge role={"ROLE_DRIVER"} currentUser={currentUser} />
+                          <RoleBadge role={""} currentUser={currentUser} />
                       </div>
                       <div style={{ margin: '0 5px' }}>
killedBy: ProfilePage tests renders correctly for driver
statusReason: Error: Unable to find an element by: [data-testid="role-badge-driver"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/ProfilePage.js:110:169
                   </div>
                     <p></p>
                     <>
-                    <p className="lead text-muted" >{"cell phone number: "} {whichNumber ? (updatedPhoneNumber ? updatedPhoneNumber : "N/A") : (cellPhone ? cellPhone : "N/A")}</p>
+                    <p className="lead text-muted" >{"cell phone number: "} {whichNumber ? (updatedPhoneNumber ? updatedPhoneNumber : "N/A") : (cellPhone ? cellPhone : "")}</p>
       <Button variant="primary" onClick={handleShow}>
         Change Cell Phone Number
killedBy: CellPhone tests renders correctly for admin user
statusReason: Error: Unable to find an element with the text: cell phone number: N/A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
src/main/pages/ProfilePage.js:110:54
                   </div>
                     <p></p>
                     <>
-                    <p className="lead text-muted" >{"cell phone number: "} {whichNumber ? (updatedPhoneNumber ? updatedPhoneNumber : "N/A") : (cellPhone ? cellPhone : "N/A")}</p>
+                    <p className="lead text-muted" >{""} {whichNumber ? (updatedPhoneNumber ? updatedPhoneNumber : "N/A") : (cellPhone ? cellPhone : "N/A")}</p>
       <Button variant="primary" onClick={handleShow}>
         Change Cell Phone Number
killedBy: CellPhone tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: cell phone number: 111-111-1111. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
