[Killed] BlockStatement
main/pages/RiderApplication/RiderApplicationIndexPageAdmin.js:3:58
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RiderApplicationIndexPageAdmin() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Rider Application Index Page</h1>
-        <p>This page is under construction. Check back later for updates!</p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RiderApplicationIndexPageAdmin() {}
 
killedBy: RiderApplicationIndexPageAdmin tests Renders expected content
statusReason: Error: RiderApplicationIndexPageAdmin(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
